Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider
The Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider class provides the preview for DM tools for selected objects.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.SourceName
The source name for DM.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.registry
The registry data storage.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.modelEvents
The model events.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.callbackRegister
The callback register.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider class.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.Register(System.Type,System.Func{System.Collections.Generic.IEnumerable{Tekla.BIM.DirectManipulation.Services.Controls.IControl}})
Registers the handler associated with the specified object type.
type: The target object type.
handler: The handler.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.UnregisterCallbacks
Unregisters the callbacks.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.SetEnabled(System.Boolean)
Sets the enabled.
isEnabled: Is the preview provider enabled.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.GetPreviewResponse(Tekla.Structures.Application.Contracts.ContextualToolsRequest)
Sends the preview tools response.
request: The request.
Returns: The preview tools response.

Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.OnDmModeChanged(System.String)
Called when the DM mode has been changed.
param: The parameter.